In [1]:
import pandas as pd

df = pd.read_csv('customer_data.csv')

In [23]:
df.head(5)

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
0,Dr.,Ray,Morton,sebvajom@kol.km,Male,38,Medtronic Inc.,Health Therapist,(987) 619-2695,B6V 3W3,MB,5020000000000230,05/2018,Solo,8.36,Blue,126.23.139.2,Sunday,pm,04/05/1930
1,Miss,Claudia,Rodriquez,acu@jatsot.ug,Female,51,"Ames Department Stores, Inc.",Health Therapist,(356) 736-7352,G7M 5F3,SK,5020000000000230,07/2028,Visa,68.31,Black,106.198.76.211,Tuesday,am,12/20/1926
2,Miss,Harry,Meyer,zuz@lo.wf,Female,51,CSX Corp.,Political Scientist,(539) 246-1806,A0Z 6P9,NS,6300000000000000,02/2023,Switch,34.65,Black,186.150.187.29,Wednesday,pm,08/20/1931
3,Miss,Edith,Gilbert,hansohsi@jupec.md,Female,55,Murphy Oil Corporation,Transportation Manager,(984) 962-7494,P9I 9H3,YT,3530000000000000,02/2028,Maestro,64.59,White,80.140.57.161,Saturday,am,06/18/2001
4,Dr.,Lura,Murphy,webediti@je.st,Female,20,PETsMART Inc,Statistician,(902) 568-9748,S1A 6K0,ON,4030000000000000,10/2025,Diners Club International,20.83,Yellow,211.103.43.41,Friday,pm,06/14/2045

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 20 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   prefix      30000 non-null  object
 1   first       30000 non-null  object
 2   last        30000 non-null  object
 3   email       30000 non-null  object
 4   gender      30000 non-null  object
 5   age         30000 non-null  int64
 6   company     30000 non-null  object
 7   profession  30000 non-null  object
 8   phone       30000 non-null  object
 9   postal      30000 non-null  object
 10  province    30000 non-null  object
 11  cc_no       30000 non-null  int64
 12  cc_exp      30000 non-null  object
 13  cc_type     30000 non-null  object
 14  price(CAD)  30000 non-null  float64
 15  fav_color   30000 non-null  object
 16  ip          30000 non-null  object
 17  weekday     30000 non-null  object
 18  ampm        30000 non-null  object
 19  date        30000 non-null  object
dtypes: float64(1), int64(2), object(17)
memory usage: 4.6+ MB

In [27]:
df['age'].agg(
    max_age = 'max',
    min_age = 'min',
    avg_age = 'mean')

max_age    65.000000
min_age    18.000000
avg_age    41.550067
Name: age, dtype: float64

In [17]:
 df['full_name']=df['prefix'].astype(str)+" "+df['first'].astype(str)+" "+df['last'].astype(str)
top_names = df['full_name'].value_counts()
print(top_names)

full_name
Mr. Callie McCormick     3
Mrs. Pauline Bowers      3
Mrs. Mittie Fleming      2
Mr. Bobby Rogers         2
Mr. Julia Griffith       2
                        ..
Dr. Rodney Anderson      1
Mrs. Antonio Gibson      1
Mr. Lucinda Zimmerman    1
Mr. Jared Love           1
Mrs. Lilly Tyler         1
Name: count, Length: 29536, dtype: int64

In [3]:
grouped = df.groupby('phone').filter(lambda x: len(x)>1)
grouped[['prefix','first','last','phone']]

   prefix  first   last           phone
15   Mrs.  Lilly  Tyler  (263) 382-8004
16   Mrs.  Peter   Cain  (263) 382-8004

In [16]:
df.groupby('profession',as_index=False).agg(
    n=('profession','count')).query("profession=='Structural Engineer'").reset_index(drop=True)

            profession   n
0  Structural Engineer  87

In [14]:
df.query("profession == 'Structural Engineer' & gender == 'Male'").groupby('profession', as_index=False).agg(n=('profession', 'count'))

            profession   n
0  Structural Engineer  43

In [17]:
df.query("profession == 'Structural Engineer' & gender == 'Female' & province=='AB'").groupby('profession', as_index=False).agg(n=('profession', 'count'))

            profession  n
0  Structural Engineer  4

In [19]:
df['price(CAD)'].agg(
    max_amount = 'max',
    min_amount = 'min',
    avg_amount = 'mean')

max_amount    100.000000
min_amount      0.000000
avg_amount     49.990775
Name: price(CAD), dtype: float64

In [26]:
df[df['price(CAD)']==0]

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
5320,Dr.,Bruce,Bryan,ru@pubuspuh.cl,Male,59,Wal-Mart Stores Inc,Engineer Technician,(709) 446-8317,H6H 3Y0,NU,201000000000000,04/2024,Bankcard,0.0,White,82.70.62.64,Wednesday,am,12/11/1900
10597,Mrs.,Flora,Clark,wad@me.com,Female,27,MetLife Inc.,Cruise Director,(775) 373-6590,B2U 8K6,NB,30100000000000,05/2020,Diners Club Carte Blanche,0.0,Red,231.156.15.63,Thursday,pm,08/22/1904

In [28]:
df[df['price(CAD)']>=100]

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
76,Mrs.,Gregory,Brown,hav@jek.gs,Female,31,"E*Trade Group, Inc.",Novelist,(625) 537-8923,X3S 4Q2,PE,6010000000000000,04/2018,Visa,100.0,Green,212.100.18.95,Monday,am,10/23/2063
21093,Mrs.,Cody,Christensen,get@jovu.ag,Male,28,National City Corp.,Hospital Administrator,(261) 737-3292,X0S 1O5,PE,201000000000000,03/2024,JCB,100.0,Green,168.48.19.165,Wednesday,pm,03/28/1955
24385,Miss,Lizzie,Dixon,goh@tuwjaz.gd,Female,38,FleetBoston Financial Co.,Compensation Analyst,(989) 239-1752,V8X 9V6,NB,6300000000000000,07/2019,Bankcard,100.0,Blue,140.87.99.78,Saturday,pm,03/03/1983

In [31]:
df.query("cc_no==5020000000000230").loc[:,'email'].count()

np.int64(2)

In [41]:
df.query("cc_exp.str.endswith('2019')").loc[:,'cc_exp'].count()

np.int64(2684)

In [42]:
df.query("cc_type=='Visa'")['cc_type'].count()

np.int64(1721)

In [48]:
df.query("cc_type=='Visa' & `price(CAD)`==100")[['prefix','first','last']]

   prefix    first   last
76   Mrs.  Gregory  Brown

In [56]:
df['profession'].value_counts().head(2)

profession
Preschool Teacher       112
Distribution Manager    107
Name: count, dtype: int64

In [62]:
df['email_domain'].value_counts().head(5)

email_domain
gmail.com      1687
me.com         1676
outlook.com    1664
live.com       1660
hotmail.com    1659
Name: count, dtype: int64

In [60]:
df.query("email_domain=='am.edu'")[['prefix','first','last','email']]

    prefix    first      last         email
150   Miss  Loretta  Fletcher  barit@am.edu

In [64]:
df['weekday'].value_counts().head(1)

weekday
Saturday    4376
Name: count, dtype: int64